using System.Collections.Generic;

public static class Images
{
    // Словарь для изображений химических веществ
    public static Dictionary<string, string> ChemicalImages = new Dictionary<string, string>
    {
        {"Перекись водорода", "Изображения/Пероксид_водорода.jpg"},
        {"Поваренная соль", "Изображения/Поваренная_соль.jpg"},
        {"Глюкоза", "Изображения/Глюкоза.jpg"},
        {"Этанол", "Изображения/Этанол.jpg"},
        {"Ацетилсалициловая кислота", "Изображения/Ацетилсалициловая_кислота.jpg"},
        {"Вода", "Изображения/Вода.jpg"},
        {"Серная кислота", "Изображения/Серная_кислота.jpg"},
        {"Нитроглицерин", "Изображения/Нитроглицирин.jpg"},
        {"Алмаз", "Изображения/Алмаз.jpg"},
        {"Аметист", "Изображения/Аметист.jpg"},
        {"Рубин", "Изображения/Рубин.jpg"},
        {"Изумруд", "Изображения/Изумруд.jpg"},
        {"Малахит", "Изображения/Малахит.jpg"},
        {"Гранат", "Изображения/Гранат.jpg"},
        {"Сапфир", "Изображения/Сапфир.jpg"},
        {"Агат", "Изображения/Агат.jpg"},
    };

    // Словарь для изображений кристаллической решётки
    public static Dictionary<string, string> CrystalStructureImages = new Dictionary<string, string>
    {
        {"Перекись водорода", "Изображения/КР_Пероксида_Водорода.jpg"},
        {"Поваренная соль", "Изображения/КР_Поваренная_соль.jpg"},
        {"Глюкоза", "Изображения/КР_Глюкоза.jpg"},
        {"Этанол", "Изображения/КР_Этанол.jpg"},
        {"Ацетилсалициловая кислота", "Изображения/КР_Ацетилсалициловая_кислота.jpg"},
        {"Вода", "Изображения/КР_Вода.jpg"},
        {"Серная кислота", "Изображения/КР_Серная_кислота.jpg"},
        {"Нитроглицерин", "Изображения/КР_Нитроглицирин.jpg"},
        {"Алмаз", "Изображения/КР_Алмаз.jpg"},
        {"Аметист", "Изображения/КР_Аметист.jpg"},
        {"Рубин", "Изображения/КР_Рубин.jpg"},
        {"Изумруд", "Изображения/КР_Изумруд.jpg"},
        {"Малахит", "Изображения/КР_Малахит.jpg"},
        {"Гранат", "Изображения/КР_Гранат.jpg"},
        {"Сапфир", "Изображения/КР_Сапфир.jpg"},
        {"Агат", "Изображения/КР_Агат.jpg"},
    };
}